In [2]:
import pandas as pd
import numpy as np

In [6]:
print(pd.__version__)

1.4.4

In [11]:
s=pd.Series()#note the 'S'
print(s)
print(type(s))

Series([], dtype: float64)
<class 'pandas.core.series.Series'>

C:\Users\ram\AppData\Local\Temp\ipykernel_2780\3651937901.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s=pd.Series()

In [16]:
array=np.array((1,2,3,4,5,6,7))#note that series dont have a default cokumn poition name
s=pd.Series(array)
print(s)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int32

In [17]:
s=pd.Series(array,index=[10,11,12,13,14,15,16])
print(s)

10    1
11    2
12    3
13    4
14    5
15    6
16    7
dtype: int32

In [15]:
data={'a':0,'b':1,'c':2,'d':3}
s2=pd.Series(data)#key becomes index in a dictionary
s2

a    0
b    1
c    2
d    3
dtype: int64

In [25]:
s3=pd.Series(data,index=['a','b','c'])#index have more importance.lesser indexeas shows lesser value and extra indices show NaN values
print(s3)

a    0
b    1
c    2
dtype: int64

In [29]:
s4=pd.Series('h',index=['a','b','c'])
print(s4)

a    h
b    h
c    h
dtype: object

In [34]:
print(s3['b'])

1

In [37]:
df1=pd.DataFrame()
print(df1)
print(type(df1))

Empty DataFrame
Columns: []
Index: []
<class 'pandas.core.frame.DataFrame'>

In [40]:
list=[1,2,3,4,5,6,7,8,9]
df2=pd.DataFrame(list)
print(df2)

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [42]:
list3=[['alex',10],['bob',20],['clark',30]]
df3=pd.DataFrame(list3)
print(df3)

       0   1
0   alex  10
1    bob  20
2  clark  30

In [43]:
list3=[['alex',10],['bob',20],['clark',30]]
df3=pd.DataFrame(list3,columns=['name','age'])
print(df3)

    name  age
0   alex   10
1    bob   20
2  clark   30

In [46]:
dict1={'names':['ram','tom','cat','dog'],'age':[10,20,30,40]}
df4=pd.DataFrame(dict1)
print(df4)

  names  age
0   ram   10
1   tom   20
2   cat   30
3   dog   40

In [55]:
list5=[{'a':1,'b':2,'c':3},{'d':4,'e':5,'f':6}]
df5=pd.DataFrame(list5)
print(df5)

     a    b    c    d    e    f
0  1.0  2.0  3.0  NaN  NaN  NaN
1  NaN  NaN  NaN  4.0  5.0  6.0

In [51]:
tuple3=([{'a':1,'b':2,'c':3},{'d':4,'e':5,'f':6}],[{'a':1,'b':2,'c':3},{'d':4,'e':5,'f':6}])
df6=pd.DataFrame(tuple3)
print(df6)

                          0                         1
0  {'a': 1, 'b': 2, 'c': 3}  {'d': 4, 'e': 5, 'f': 6}
1  {'a': 1, 'b': 2, 'c': 3}  {'d': 4, 'e': 5, 'f': 6}

In [52]:
df7=pd.DataFrame(list5, index= ['first','second'],columns=['a','b'])#selecting coumns a and b
print(df7)

          a    b
first   1.0  2.0
second  NaN  NaN

In [56]:
df8=pd.DataFrame(list5, index= ['first','second'],columns=['a','b1'])
print(df8)

          a  b1
first   1.0 NaN
second  NaN NaN

## dictionary of series

In [61]:
seriesdict={'one':pd.Series([1,2,3],index=['a','b','c']) , 'two':pd.Series([3,4,5,6],index=['a','b','c','d'])}
seriesdf=pd.DataFrame(seriesdict)
print(seriesdf)

   one  two
a  1.0    3
b  2.0    4
c  3.0    5
d  NaN    6

In [64]:
print(seriesdf['two'])

a    3
b    4
c    5
d    6
Name: two, dtype: int64

In [65]:
print(seriesdf.get('two'))

a    3
b    4
c    5
d    6
Name: two, dtype: int64

In [68]:
seriesdf['three']=pd.Series([10,20,30,40],index=['a','b','c','d'])
print(seriesdf)

   one  two  three
a  1.0    3     10
b  2.0    4     20
c  3.0    5     30
d  NaN    6     40

In [69]:
seriesdf['four']=seriesdf['one']+seriesdf['two']
print(seriesdf)

   one  two  three  four
a  1.0    3     10   4.0
b  2.0    4     20   6.0
c  3.0    5     30   8.0
d  NaN    6     40   NaN

In [76]:
seriesdf.insert(4,'five',[21,22,23,24],True)#starts from o to 4,
print(seriesdf)#'=' can be done or not

   one  two  three  four  five  five  five  five
a  1.0    3     10   4.0    21    21    21    21
b  2.0    4     20   6.0    22    22    22    22
c  3.0    5     30   8.0    23    23    23    23
d  NaN    6     40   NaN    24    24    24    24

In [77]:
seriesdf=seriesdf.assign(six=['delhi','banglore','chennai','patna'])
print(seriesdf)

   one  two  three  four  five  five  five  five       six
a  1.0    3     10   4.0    21    21    21    21     delhi
b  2.0    4     20   6.0    22    22    22    22  banglore
c  3.0    5     30   8.0    23    23    23    23   chennai
d  NaN    6     40   NaN    24    24    24    24     patna

In [81]:
del seriesdf['four']
print(seriesdf)

   one  two  three       six
a  1.0    3     10     delhi
b  2.0    4     20  banglore
c  3.0    5     30   chennai
d  NaN    6     40     patna

In [83]:
seriesdf.pop('six')

KeyError: 'six'

In [84]:
print(seriesdf)

   one  two  three
a  1.0    3     10
b  2.0    4     20
c  3.0    5     30
d  NaN    6     40

In [89]:
print(seriesdf.at['c','two'])

5

In [29]:
print(seriesdf.loc['b'])

NameError: name 'seriesdf' is not defined

In [91]:
print(seriesdf.loc['a':'c':2])

   one  two  three
a  1.0    3     10
c  3.0    5     30

In [92]:
print(seriesdf.iloc[3])#index number position integer

one       NaN
two       6.0
three    40.0
Name: d, dtype: float64

In [93]:
print(seriesdf)

   one  two  three
a  1.0    3     10
b  2.0    4     20
c  3.0    5     30
d  NaN    6     40

In [94]:
print(seriesdf.iloc[3,1])

6

In [102]:
add_df=pd.DataFrame([[1,2,3],[3,4,5],[6,7,8]], columns=['one','two','three'])
print(add_df)

   one  two  three
0    1    2      3
1    3    4      5
2    6    7      8

In [103]:
seriesdf=seriesdf.append(add_df)
print(seriesdf)

   one  two  three    0    1    2
a  1.0  3.0   10.0  NaN  NaN  NaN
b  2.0  4.0   20.0  NaN  NaN  NaN
c  3.0  5.0   30.0  NaN  NaN  NaN
d  NaN  6.0   40.0  NaN  NaN  NaN
0  NaN  NaN    NaN  1.0  2.0  3.0
1  NaN  NaN    NaN  3.0  4.0  5.0
2  NaN  NaN    NaN  6.0  7.0  8.0
0  NaN  NaN    NaN  1.0  2.0  3.0
1  NaN  NaN    NaN  3.0  4.0  5.0
2  NaN  NaN    NaN  6.0  7.0  8.0
0  1.0  2.0    3.0  NaN  NaN  NaN
1  3.0  4.0    5.0  NaN  NaN  NaN
2  6.0  7.0    8.0  NaN  NaN  NaN

C:\Users\ram\AppData\Local\Temp\ipykernel_2780\567473498.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  seriesdf=seriesdf.append(add_df)

In [105]:
seriesdf=seriesdf.reset_index()

In [115]:
seriesdf

   index  one  two  three    0    1    2
1      b  2.0  4.0   20.0  NaN  NaN  NaN
2      c  3.0  5.0   30.0  NaN  NaN  NaN
3      d  NaN  6.0   40.0  NaN  NaN  NaN
4      0  NaN  NaN    NaN  1.0  2.0  3.0
5      1  NaN  NaN    NaN  3.0  4.0  5.0
6      2  NaN  NaN    NaN  6.0  7.0  8.0
7      0  NaN  NaN    NaN  1.0  2.0  3.0
8      1  NaN  NaN    NaN  3.0  4.0  5.0
9      2  NaN  NaN    NaN  6.0  7.0  8.0
10     0  1.0  2.0    3.0  NaN  NaN  NaN
11     1  3.0  4.0    5.0  NaN  NaN  NaN
12     2  6.0  7.0    8.0  NaN  NaN  NaN

In [108]:
seriesdf=seriesdf.drop(0)#0 is the index number
print(seriesdf)

   index  one  two  three    0    1    2
1      b  2.0  4.0   20.0  NaN  NaN  NaN
2      c  3.0  5.0   30.0  NaN  NaN  NaN
3      d  NaN  6.0   40.0  NaN  NaN  NaN
4      0  NaN  NaN    NaN  1.0  2.0  3.0
5      1  NaN  NaN    NaN  3.0  4.0  5.0
6      2  NaN  NaN    NaN  6.0  7.0  8.0
7      0  NaN  NaN    NaN  1.0  2.0  3.0
8      1  NaN  NaN    NaN  3.0  4.0  5.0
9      2  NaN  NaN    NaN  6.0  7.0  8.0
10     0  1.0  2.0    3.0  NaN  NaN  NaN
11     1  3.0  4.0    5.0  NaN  NaN  NaN
12     2  6.0  7.0    8.0  NaN  NaN  NaN

In [120]:
df=pd.DataFrame({'legs':[2,4,3,6],'wings':[2,0,0,0]}, index=['falcon','dog','cat','ant'])
df

        legs  wings
falcon     2      2
dog        4      0
cat        3      0
ant        6      0

In [121]:
df.value_counts()

legs  wings
2     2        1
3     0        1
4     0        1
6     0        1
dtype: int64

# data wrangling

In [6]:
import pandas as pd
data1={'employee id':[1,2,3,4,5],
  'employee name':['ram','abhi','jishnu','vishnu','abhinand']}
data2={'employee id':[4,5,6,7],
  'employee name':['ram sankar','abhinand','jis','vish']}

df1=pd.DataFrame(data1,columns=['employee id', 'employee name'])
df2=pd.DataFrame(data2,columns=['employee id', 'employee name'])
print(df1)

print(df2)

   employee id employee name
0            1           ram
1            2          abhi
2            3        jishnu
3            4        vishnu
4            5      abhinand
   employee id employee name
0            4    ram sankar
1            5      abhinand
2            6           jis
3            7          vish

   employee id employee name
0            5      abhinand

In [9]:
print(pd.merge(df1,df2, on='employee id'))

   employee id employee name_x employee name_y
0            4          vishnu      ram sankar
1            5        abhinand        abhinand

In [8]:
print(pd.concat([df1,df2]))

   employee id employee name
0            1           ram
1            2          abhi
2            3        jishnu
3            4        vishnu
4            5      abhinand
0            4    ram sankar
1            5      abhinand
2            6           jis
3            7          vish

In [57]:
group = df2.groupby('employee name')
print(group)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000021388BCFB20>

In [58]:
group = df2.groupby('employee name').get_group('abhinand')
print(group)

   employee id employee name
1            5      abhinand

In [12]:
print(group.get_group('abhinand'))

   employee id employee name
1            5      abhinand

In [14]:
print(df2.groupby('employee name').get_group('abhinand'))

   employee id employee name
1            5      abhinand

In [18]:
import numpy as np
df=pd.DataFrame(np.random.randn(5,3),index=['a','b','c','d','e'],columns=['one','two','three'])#note the b1 for later
df

        one       two     three
a  1.167513  0.151193  0.821877
b  0.824489 -1.715385  1.264709
c  0.364751  2.358122  0.750796
d  0.677717  2.358950  0.704855
e  0.209801 -1.303708 -0.330754

In [20]:
df=df.reindex(['a','b','c','d','e','f','h'])
df

        one       two     three
a  1.167513  0.151193  0.821877
b  0.824489 -1.715385  1.264709
c  0.364751  2.358122  0.750796
d  0.677717  2.358950  0.704855
e  0.209801 -1.303708 -0.330754
f       NaN       NaN       NaN
h       NaN       NaN       NaN

In [21]:
print(df.isnull())

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False
e  False  False  False
f   True   True   True
h   True   True   True

In [23]:
print(df.notnull())

     one    two  three
a   True   True   True
b   True   True   True
c   True   True   True
d   True   True   True
e   True   True   True
f  False  False  False
h  False  False  False

In [27]:
print(df['one'].isnull())#df['one']only columns works.for rows use use loc.loc only works for index

a    False
b    False
c    False
d    False
e    False
f     True
h     True
Name: one, dtype: bool

In [31]:
print(df.loc['a'])

one      1.167513
two      0.151193
three    0.821877
Name: a, dtype: float64

In [32]:
print(df.dropna())#if one cell have an empty value, that row is eliminated

        one       two     three
a  1.167513  0.151193  0.821877
b  0.824489 -1.715385  1.264709
c  0.364751  2.358122  0.750796
d  0.677717  2.358950  0.704855
e  0.209801 -1.303708 -0.330754

In [33]:
df

        one       two     three
a  1.167513  0.151193  0.821877
b  0.824489 -1.715385  1.264709
c  0.364751  2.358122  0.750796
d  0.677717  2.358950  0.704855
e  0.209801 -1.303708 -0.330754
f       NaN       NaN       NaN
h       NaN       NaN       NaN

In [34]:
print(df.dropna(axis=1))

Empty DataFrame
Columns: []
Index: [a, b, c, d, e, f, h]

In [35]:
#df.dropna doesnt change df unless it isassigned (df=), but function del is  an exception.s owe use  drop

In [37]:
df=pd.DataFrame({
    'brand':['yum yum','yum yum','yum yum','indomie','indomie','indomie'],
    'style':['cup','cup','cup','cup','pack','pack'],
    'rating':[4,4,4,3.5,15,5]
})
df

     brand style  rating
0  yum yum   cup     4.0
1  yum yum   cup     4.0
2  yum yum   cup     4.0
3  indomie   cup     3.5
4  indomie  pack    15.0
5  indomie  pack     5.0

In [39]:
print(df.duplicated())

0    False
1     True
2     True
3    False
4    False
5    False
dtype: bool

In [52]:
boolean=df.duplicated(keep='last')
print(boolean)

0     True
1     True
2    False
3    False
4    False
5    False
dtype: bool

In [51]:
df.duplicated(keep=False)
print(boolean)

0     True
1     True
2     True
3    False
4    False
5    False
dtype: bool

In [53]:
print(boolean.value_counts())

False    4
True     2
dtype: int64

In [49]:
boolean.value_counts()#error because the original is included in c

True     3
False    3
dtype: int64

In [50]:
df.duplicated().sum()

2

In [63]:
d1={'company':['google','google','microsoft','microsoft','facebook','facebook'],
   'person':['kailas','sanal','amy','sudheesh','shanid','jaison'],
   'sales':[200,120,340,124,243,350]}
df=pd.DataFrame(d1)
print(df)

     company    person  sales
0     google    kailas    200
1     google     sanal    120
2  microsoft       amy    340
3  microsoft  sudheesh    124
4   facebook    shanid    243
5   facebook    jaison    350

In [64]:
df.groupby('company')

In [65]:
by_comp=df.groupby('company')
print(by_comp)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000021388BE83D0>

In [66]:
print(type(by_comp))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [67]:
by_comp.mean()

           sales
company
facebook   296.5
google     160.0
microsoft  232.0

In [68]:
by_comp.std()

                sales
company
facebook    75.660426
google      56.568542
microsoft  152.735065

In [69]:
by_comp.min()

           person  sales
company
facebook   jaison    243
google     kailas    120
microsoft     amy    124

In [70]:
by_comp.max()

             person  sales
company
facebook     shanid    350
google        sanal    200
microsoft  sudheesh    340

In [71]:
by_comp.count()

           person  sales
company
facebook        2      2
google          2      2
microsoft       2      2

In [72]:
by_comp.describe()

          sales
          count   mean         std    min     25%    50%     75%    max
company
facebook    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
google      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
microsoft   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [74]:
by_comp.describe().transpose()['google']

sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: google, dtype: float64

# data input and output

In [75]:
#data resources: google datasetresearch, kaggle,uci machine learning repository

SyntaxError: invalid syntax (2083894040.py, line 1)

In [7]:
df=pd.read_csv('data.csv')

In [77]:
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [80]:
df.head(11)

    Duration  Pulse  Maxpulse  Calories
0         60    110       130     409.1
1         60    117       145     479.0
2         60    103       135     340.0
3         45    109       175     282.4
4         45    117       148     406.0
5         60    102       127     300.0
6         60    110       136     374.0
7         45    104       134     253.3
8         30    109       133     195.1
9         60     98       124     269.0
10        60    103       147     329.3

In [82]:
df.tail(11)

     Duration  Pulse  Maxpulse  Calories
158        60    114       150     382.8
159        30     80       120     240.9
160        30     85       120     250.4
161        45     90       130     260.4
162        45     95       130     270.0
163        45    100       140     280.9
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [84]:
!pip install xlrd
!pip install openpyxl

Requirement already satisfied: xlrd in c:\users\ram\anaconda3\lib\site-packages (2.0.1)
Requirement already satisfied: openpyxl in c:\users\ram\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\users\ram\anaconda3\lib\site-packages (from openpyxl) (1.1.0)

In [97]:
import xlrd
import openpyxl
df3=pd.read_excel('Book1.xlsx')
print(df3)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age            Hire Date  \
0    Research & Development  Female      Black   55  2016-08-04 00:00:00
1             Manufacturing    Male      Asian   59           11/29/1997
2       Speciality Products  Female  Caucasian   50           10/26/2006
3             Manufacturing  Female  Caucasian   26            9/27/2019
4             Manufacturing    Male      Asian   55           11/20/1995
..                      ...     ...        ...  ...                  ...
995     Speciality Products    Male  Caucasian   33            9/18/2016
996     Speciality Products  Female      Asian   44            5/31/2010
997     Speciality Products    Male      Asian   31  2019-10-06 00:00:00
998     Speciality Products  Female      Asian   33            1/28/2012
999               Corporate  Female      Asian   63            7/26/2020

    Annual Salary  Bonus %        Country       City            Exit Date
0       $141,604      0.15  United States    Seattle           10/16/2021
1        $99,975      0.00          China  Chongqing                  NaN
2       $163,099      0.20  United States    Chicago                  NaN
3        $84,913      0.07  United States    Chicago                  NaN
4        $95,409      0.00  United States    Phoenix                  NaN
..            ...      ...            ...        ...                  ...
995      $98,427      0.00  United States   Columbus                  NaN
996      $47,387      0.00          China    Chengdu  2018-08-01 00:00:00
997     $176,710      0.15  United States      Miami                  NaN
998      $95,960      0.00          China    Chengdu                  NaN
999     $216,195      0.31  United States      Miami                  NaN

[1000 rows x 14 columns]

In [99]:
df3.head()

,EEID,Full Name,Job Title,Department,Business Unit,Gender,Ethnicity,Age,Hire Date,Annual Salary,Bonus %,Country,City,Exit Date
0,E02387,Emily Davis,Sr. Manger,IT,Research & Development,Female,Black,55,2016-08-04 00:00:00,"$141,604",0.15,United States,Seattle,10/16/2021
1,E04105,Theodore Dinh,Technical Architect,IT,Manufacturing,Male,Asian,59,11/29/1997,"$99,975",0.00,China,Chongqing,NaN
2,E02572,Luna Sanders,Director,Finance,Speciality Products,Female,Caucasian,50,10/26/2006,"$163,099",0.20,United States,Chicago,NaN
3,E02832,Penelope Jordan,Computer Systems Manager,IT,Manufacturing,Female,Caucasian,26,9/27/2019,"$84,913",0.07,United States,Chicago,NaN
4,E01639,Austin Vo,Sr. Analyst,Finance,Manufacturing,Male,Asian,55,11/20/1995,"$95,409",0.00,United States,Phoenix,NaN

In [6]:
import pandas as pd
data=pd.read_json('jsonfile.json')
data.head()

                                                    quiz
maths  {'q1': {'question': '5 + 7 = ?', 'options': ['...
sport  {'q1': {'question': 'Which one is correct team...

In [8]:
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

# dataset analysis

In [54]:
df=pd.read_csv('data.csv')
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [13]:
df.to_string()

'     Duration  Pulse  Maxpulse  Calories\n0          60    110       130     409.1\n1          60    117       145     479.0\n2          60    103       135     340.0\n3          45    109       175     282.4\n4          45    117       148     406.0\n5          60    102       127     300.0\n6          60    110       136     374.0\n7          45    104       134     253.3\n8          30    109       133     195.1\n9          60     98       124     269.0\n10         60    103       147     329.3\n11         60    100       120     250.7\n12         60    106       128     345.3\n13         60    104       132     379.3\n14         60     98       123     275.0\n15         60     98       120     215.2\n16         60    100       120     300.0\n17         45     90       112       NaN\n18         60    103       123     323.0\n19         45     97       125     243.0\n20         60    108       131     364.2\n21         45    100       119     282.0\n22         60    130       101     300.0\n23         45    105       132     246.0\n24         60    102       126     334.5\n25         60    100       120     250.0\n26         60     92       118     241.0\n27         60    103       132       NaN\n28         60    100       132     280.0\n29         60    102       129     380.3\n30         60     92       115     243.0\n31         45     90       112     180.1\n32         60    101       124     299.0\n33         60     93       113     223.0\n34         60    107       136     361.0\n35         60    114       140     415.0\n36         60    102       127     300.0\n37         60    100       120     300.0\n38         60    100       120     300.0\n39         45    104       129     266.0\n40         45     90       112     180.1\n41         60     98       126     286.0\n42         60    100       122     329.4\n43         60    111       138     400.0\n44         60    111       131     397.0\n45         60     99       119     273.0\n46         60    109       153     387.6\n47         45    111       136     300.0\n48         45    108       129     298.0\n49         60    111       139     397.6\n50         60    107       136     380.2\n51         80    123       146     643.1\n52         60    106       130     263.0\n53         60    118       151     486.0\n54         30    136       175     238.0\n55         60    121       146     450.7\n56         60    118       121     413.0\n57         45    115       144     305.0\n58         20    153       172     226.4\n59         45    123       152     321.0\n60        210    108       160    1376.0\n61        160    110       137    1034.4\n62        160    109       135     853.0\n63         45    118       141     341.0\n64         20    110       130     131.4\n65        180     90       130     800.4\n66        150    105       135     873.4\n67        150    107       130     816.0\n68         20    106       136     110.4\n69        300    108       143    1500.2\n70        150     97       129    1115.0\n71         60    109       153     387.6\n72         90    100       127     700.0\n73        150     97       127     953.2\n74         45    114       146     304.0\n75         90     98       125     563.2\n76         45    105       134     251.0\n77         45    110       141     300.0\n78        120    100       130     500.4\n79        270    100       131    1729.0\n80         30    159       182     319.2\n81         45    149       169     344.0\n82         30    103       139     151.1\n83        120    100       130     500.0\n84         45    100       120     225.3\n85         30    151       170     300.0\n86         45    102       136     234.0\n87        120    100       157    1000.1\n88         45    129       103     242.0\n89         20     83       107      50.3\n90        180    101       127     600.1\n91         45    107       137       NaN\n92         30     90       107     105.3\n93         15     80       100      50.5\n94         20    150       171     127.4\n95         20    151       168     229.4\n96         30     95       128     128.2\n97         25    152       168     244.2\n98         30    109       131     188.2\n99         90     93       124     604.1\n100        20     95       112      77.7\n101        90     90       110     500.0\n102        90     90       100     500.0\n103        90     90       100     500.4\n104        30     92       108      92.7\n105        30     93       128     124.0\n106       180     90       120     800.3\n107        30     90       120      86.2\n108        90     90       120     500.3\n109       210    137       184    1860.4\n110        60    102       124     325.2\n111        45    107       124     275.0\n112        15    124       139     124.2\n113        45    100       120     225.3\n114        60    108       131     367.6\n115        60    108       151     351.7\n116        60    116       141     443.0\n117        60     97       122     277.4\n118        60    105       125       NaN\n119        60    103       124     332.7\n120        30    112       137     193.9\n121        45    100       120     100.7\n122        60    119       169     336.7\n123        60    107       127     344.9\n124        60    111       151     368.5\n125        60     98       122     271.0\n126        60     97       124     275.3\n127        60    109       127     382.0\n128        90     99       125     466.4\n129        60    114       151     384.0\n130        60    104       134     342.5\n131        60    107       138     357.5\n132        60    103       133     335.0\n133        60    106       132     327.5\n134        60    103       136     339.0\n135        20    136       156     189.0\n136        45    117       143     317.7\n137        45    115       137     318.0\n138        45    113       138     308.0\n139        20    141       162     222.4\n140        60    108       135     390.0\n141        60     97       127       NaN\n142        45    100       120     250.4\n143        45    122       149     335.4\n144        60    136       170     470.2\n145        45    106       126     270.8\n146        60    107       136     400.0\n147        60    112       146     361.9\n148        30    103       127     185.0\n149        60    110       150     409.4\n150        60    106       134     343.0\n151        60    109       129     353.2\n152        60    109       138     374.0\n153        30    150       167     275.8\n154        60    105       128     328.0\n155        60    111       151     368.5\n156        60     97       131     270.4\n157        60    100       120     270.4\n158        60    114       150     382.8\n159        30     80       120     240.9\n160        30     85       120     250.4\n161        45     90       130     260.4\n162        45     95       130     270.0\n163        45    100       140     280.9\n164        60    105       140     290.8\n165        60    110       145     300.0\n166        60    115       145     310.2\n167        75    120       150     320.4\n168        75    125       150     330.4'

In [14]:
type(df.to_string())

str

In [15]:
df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [16]:
df.tail()

     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [18]:
df.dtypes

Duration      int64
Pulse         int64
Maxpulse      int64
Calories    float64
dtype: object

In [20]:
df.shape

(169, 4)

# statistical info

In [21]:
df.describe()

         Duration       Pulse    Maxpulse     Calories
count  169.000000  169.000000  169.000000   164.000000
mean    63.846154  107.461538  134.047337   375.790244
std     42.299949   14.510259   16.450434   266.379919
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   250.925000
50%     60.000000  105.000000  131.000000   318.600000
75%     60.000000  111.000000  141.000000   387.600000
max    300.000000  159.000000  184.000000  1860.400000

In [22]:
df.columns

Index(['Duration', 'Pulse', 'Maxpulse', 'Calories'], dtype='object')

In [23]:
type(df.columns)

pandas.core.indexes.base.Index

In [24]:
df.index

RangeIndex(start=0, stop=169, step=1)

In [36]:
df.duplicated().sum()

7

In [38]:
df=df.drop_duplicates()

In [39]:
df.shape

(162, 4)

In [40]:
df.value_counts()#note for later

Duration  Pulse  Maxpulse  Calories
15        80     100       50.5        1
60        109    153       387.6       1
          108    131       364.2       1
                           367.6       1
                 135       390.0       1
                                      ..
45        117    148       406.0       1
          118    141       341.0       1
          122    149       335.4       1
          123    152       321.0       1
300       108    143       1500.2      1
Length: 157, dtype: int64

In [44]:
df['Pulse'].value_counts().head()# NOTE

100    16
90     11
103     9
109     8
107     8
Name: Pulse, dtype: int64

In [47]:
df.isnull().sum()

Duration    0
Pulse       0
Maxpulse    0
Calories    5
dtype: int64

In [48]:
#lookup dropna()

In [49]:
#datacleaning=error,nan,format,duplicates.still comes under data analysis
#write down dataset anlysis, data analysis

In [50]:
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[162 rows x 4 columns]

In [52]:
df.dropna(inplace=True)#changes the originat dataset

C:\Users\ram\AppData\Local\Temp\ipykernel_10052\1763877594.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.dropna(inplace=True)#changes the originat dataset

In [55]:
df.fillna(130, inplace=True)

In [56]:
df.isnull().sum()

Duration    0
Pulse       0
Maxpulse    0
Calories    0
dtype: int64

In [58]:
df['Calorie'].fillna(130,inplace=True)

In [61]:
df['Calorie'][0]

KeyError: 'Calorie'

In [62]:
#reeplece null value using mean
x=df['Calories'].mean()
df['Calories'].fillna(x,inplace=True)

In [64]:
#likewise median and mode

In [65]:
#df['date']=pd.to_datetime(df['date'])
#Nat
#df.dropna(subset=['date'],inplace=True) => removes the row if data colun is NaT(not at time)

In [1]:
#pandas cleaning

My name is John, I am  36

In [14]:
import pandas
df=pandas.read_csv('data.csv')
print(df)
df.iloc[:,:]

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [23]:
df.groupby('Duration').describe().transpose()[15]

Pulse     count      2.000000
          mean     102.000000
          std       31.112698
          min       80.000000
          25%       91.000000
          50%      102.000000
          75%      113.000000
          max      124.000000
Maxpulse  count      2.000000
          mean     119.500000
          std       27.577164
          min      100.000000
          25%      109.750000
          50%      119.500000
          75%      129.250000
          max      139.000000
Calories  count      2.000000
          mean      87.350000
          std       52.113770
          min       50.500000
          25%       68.925000
          50%       87.350000
          75%      105.775000
          max      124.200000
Name: 15, dtype: float64